---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralU
source: html/4e24ba22-f3d4-3bf8-49ca-5d401d0cfa88.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralU

Defines parameters for general Channel shape.

## Syntax (C#)
```csharp
public class StructuralSectionGeneralU : StructuralSectionHotRolled
```